app/controllers/users_controller.rb

  def create
    @user = User.create user_params
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Samuel"], ["created_at", "2020-06-20 12:17:59.704633"], ["updated_at", "2020-06-20 12:17:59.704633"]]